{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_15","layers":[{"class_name":"Dense","config":{"units":222,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense65","trainable":true,"batch_input_shape":[null,222],"dtype":"float32"}},{"class_name":"Dense","config":{"units":70,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense66","trainable":true}},{"class_name":"Dense","config":{"units":70,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense67","trainable":true}},{"class_name":"Dense","config":{"units":70,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense68","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense69","trainable":true}}]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense65/kernel","shape":[222,222],"dtype":"float32"},{"name":"dense_Dense65/bias","shape":[222],"dtype":"float32"},{"name":"dense_Dense66/kernel","shape":[222,70],"dtype":"float32"},{"name":"dense_Dense66/bias","shape":[70],"dtype":"float32"},{"name":"dense_Dense67/kernel","shape":[70,70],"dtype":"float32"},{"name":"dense_Dense67/bias","shape":[70],"dtype":"float32"},{"name":"dense_Dense68/kernel","shape":[70,70],"dtype":"float32"},{"name":"dense_Dense68/bias","shape":[70],"dtype":"float32"},{"name":"dense_Dense69/kernel","shape":[70,1],"dtype":"float32"},{"name":"dense_Dense69/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.9.0","convertedBy":null}