{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_11","layers":[{"class_name":"Dense","config":{"units":222,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense47","trainable":true,"batch_input_shape":[null,222],"dtype":"float32"}},{"class_name":"Dense","config":{"units":50,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense48","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense49","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense50","trainable":true}}]},"keras_version":"tfjs-layers 3.9.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense47/kernel","shape":[222,222],"dtype":"float32"},{"name":"dense_Dense47/bias","shape":[222],"dtype":"float32"},{"name":"dense_Dense48/kernel","shape":[222,50],"dtype":"float32"},{"name":"dense_Dense48/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense49/kernel","shape":[50,50],"dtype":"float32"},{"name":"dense_Dense49/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense50/kernel","shape":[50,1],"dtype":"float32"},{"name":"dense_Dense50/bias","shape":[1],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.9.0","convertedBy":null}